{
  "title": "Feeling Happy at the End of the World",
  "date": "December 11th 2017",
  "thumbnail": "/images/uploads/beach.svg",
  "body": "This year has been a surreal one for me. I’ve had years that were particularly tough, years that trended more cheerfully, but 2017 was unique and bizarre because I felt an immense guilt in my happiness.\n\nI think this might have been the year I found the most personal happiness, but the giant caveat in everything was watching the world divide, watching racism, sexism and hatred rise, and seeing some real damage that incurred on people’s lives around the world.\n\nPersonally, the biggest and most wonderful part of my whole year is that my fiancé, Dizzy Smith, has now gone two full years without needing treatment for his cancer. I don’t talk about this that much because I don’t want to jinx it, but this one thing informs so much of my happiness, I would be remiss to exclude it.\n\nWe bought a house and I moved to Denver from SF (my hometown), a change that has also brought me a lot of joy because I have more space to work (an office of my own for my first time in my life!) I get to live with Dizzy’s kids, who are the best children in the world and I’m not even biased. The only exception being the children of the people who read this article. Then it’s a tie.\n\n![me and Sudo](/images/uploads/1_bmkoo7oeasmx5zusdgjxuw.jpeg \"me and Sudo\")\n\nWe also got a puppy this year! I love Sudo so very much and have always wanted a dog. She makes every day better. The kids and the dog remind me daily of wonder, and help me feel gratitude for pieces of life I can sometimes take for granted. Grass! Rolling around in grass! I never understood why they got rid of recess.\n\nShe’s bigger now, she was so tiny when we got her!\n\nSudo will also do this thing where she picks up a stick and it makes her SO HAPPY! It’s the most important stick of all time. And then she’ll accidentally drop it but she’ll just move on. She doesn’t pine for it. She doesn’t try to hold it so tight. She just lives in the moment with her stick. Way to go.\n\nThose who know me (and probably some who don’t) know that the two things that I love most outside family and friends are travel and work itself. This year has been amazing because I’ve gotten to do both in spades. I made a promise to myself few years back to try to save up money to visit at least one new country a year. This year I spoke at nearly 50 conferences in 11 countries, 4 of which were new to me. I made acquaintances and friends all over the globe. I made a project where you can track my activities as well as my coworkers as we speak around the world. It’s made with Azure Serverless functions and Vue.js.\n\n![Globe](/images/uploads/globe.jpg \"globe\")\n\nYou can [play with the demo here](http://cda-locale.azurewebsites.net/)\n\nI got to work on so many cool projects with so many technologies! I made 18 repos, over 250 codepens, but only released 40 of them (so much bad work to get to the good stuff, haha). I put out 18 articles, all on CSS-Tricks (mostly on Vue.js!) and created some slide decks that in total got more than a half a million views. My book on [SVG Animations with O’Reilly](https://www.amazon.com/SVG-Animations-Implementations-Responsive-Animation/dp/1491939702/) was published, and my business with Val Head, [Web Animation Workshops](http://webanimationworkshops.com/), put on 7 workshops. This is all outside of the contract and consulting work I was doing, which meant my year moved at a quick pace. But I wouldn’t say that’s unusual- I’ve been happily working, and staying productive for many years now. I think people have noticed much more lately than they did even two years ago (when I had 700 followers), another thing I can be grateful for. I’ve been a software engineer for more than a decade, but no one noticed my work for most of that time. If that’s you too, all I can say is- **_keep going_**.\n\nThere’s a bittersweet part to this success, too, where I close out the year feeling that tech still has so far to go. I’m asked on average once a conference if I code or if I code my own demos, despite stating clearly now in the intro that they are mine unless I state otherwise. This doesn’t happen to my male counterparts. Whatever excuse you thought up just now to retort this, just please don’t. Please just listen for once.\n\nI also receive a good amount of harassment, usually off of educational material, which sucks. I’m not leaving tech, I’m not saying this for pity, and I’m not asking to be commended- I want to express that the experience of a woman in tech who simply wants to code is still not great. Women and people of color have to survive abuse and bias to be here and until we look this in the face and draw awareness to it I’m not doing my due diligence for the people who come after me. There are much more horrible stories that I can tell you about my career and sexual harassment than these, but those are very personal stories to tell. We have work to do. [As Alisha Ramos so eloquently put it](https://www.youtube.com/watch?v=PtKOzKNJF-s), “The strongest pipeline in the world does no good if it leads directly into the sewer.”\n\nFor my part, this year I started a more formal way of mentoring underrepresented folks. My schedule is slammed so I didn’t get to fulfill as many as I wanted to, but I worked with about a dozen people, which is a dozen more than last year. Next year I plan to do less speaking so I can make a deeper commitment to mentoring and be with my family more. It’s important to me to do so because, as someone who has been building sites and gaining knowledge from other developers via stack overflow, blogs, github, and codepen for so many years, I feel the need to even the score and try to give what I have taken back to the community. ([see this tweet for details](https://twitter.com/sarah_edo/status/878950382759813120))\n\n![tweet about poll, click on link for details](/images/uploads/screen-shot-2019-04-27-at-11.43.05-am.png \"tweet about poll, click on link for details\")\n\nSpeaking of community, I shared a post two years ago saying that it was my goal at the beginning of that year to get something published in CSS-Tricks and by the year end was a staff writer for the publication. I am still a staff writer for them today and couldn’t be more proud of being a part of it. Chris is a great voice in our community and the fellow writers and guest writers are quality all the way down. We even added a new member of our staff this year, Miriam Suzanne, whose work and speaking I greatly admire.\n\nIn the beginning of this year one of my big goals was to put out learning materials for Vue.js (an article or two I think it said). 13 articles, 12 repos and 1 Frontend Masters workshop later, and I’ve official joined the Vue Core team, my first stop is leading the effort to create a new section called The Cookbook, that walks through how to create certain patterns, shows simple and complex examples, and even speaks with nuance around when this pattern will fail, and when to consider using an alternative means of execution. I work closely alongside Chris Fritz to integrate this, which is truly awesome because I look up to him, he is a hero in terms of good documentation. I’m very excited to be working on Vue.js because I believe in the project, and reading through Evan You’s well organized and well commented source code, I feel very lucky to be on this team.\n\n![vue logo](/images/uploads/1_wfl3csj96lqpy0ivt9se3w.svg \"vue logo\")\n\nLast but certainly not least, I recently joined Microsoft as a Senior Developer Advocate, a job I love so far. It’s a good fit for me because I like working with the community, creating open source work, and working with product teams to improve things for developers. The choice to leave consulting was a hard one to make because business was booming and I like working for myself, but Microsoft’s new internal catch phrase of “meet developers where they are” really appealed to me and they let me be pretty autonomous and creative in what projects I create, which is _**the dream**_. Azure has a lot of nice offerings and I’m a naturally curious person so I’m having fun exploring the possibilities. I also love my team, Simona, Burke, Asim, Brian, and John- jobs are so much better when you like your coworkers and boss.\n\nOne thing I’m looking forward to as the year closes that has become a tradition is that my friend Meagan comes over and Meagan, Dizzy, and I write out what we’d like to accomplish in the next year. We choose 10 things or so and write detailed, actionable items. We also revisit what we wanted to accomplish last year to see how far we came. I haven’t looked at my list in a while but last I checked, it had a range from career focused to personal. No, none of them are about dieting or going to the gym 🙂. I mention this process because I recommend it. It’s a nice exercise to align yourself with what you really want and revisit if you’re actually doing things to achieve what’s actually important to you in the grand scheme of everything. I tend to get pretty focused on the details, this helps me zoom out.\n\nThat’s it! 2017 was a hard year that I’m personally grateful for. I’m a very lucky lady. I’m grateful for web development, the community it offers, and… hot damn we get to build this stuff for a living! How cool is that! When the news gets me down, I refocus on the work, because working is the best distraction in the world. Aside from puppies and sticks.",
  "tags": [
    "all posts",
    "year end review",
    "life updates"
  ]
}