{
  "title": "Mourning as a Developer",
  "date": "August 14th 2018",
  "thumbnail": "/images/uploads/mourning-feature.jpg",
  "body": "The title of this post is a little misleading- it’s not so different to mourn as a developer than a person with any other kind of job. But speaking as a developer, I’ll talk about my experiences through that lens, as I know no other.\n\nA friend of mine died last week. We weren’t best friends, but he was a great person whose company I loved, and, looking back at our digital history, realized we were there for each other through a lot of challenging times: heartbreak, harassment, job loss, and medical problems, to name a few. He was a wonderful person who was raunchy and hilarious and if you felt bad, would make you feel better by making fun of you and then giving you a sincere hug. In short, he was the best.\n\nIt’s also the two-year anniversary of the death of one of my best friends in the world. He and I dated and lived together for 4 years, and when we broke up, we remained great friends. I still remember this spooky (it gives me chills down my spine to think about it) feeling as he walked away the last time we hung out. Something felt wrong but I couldn’t put my finger on it. Not too long after, he was out for a morning hike. He was wearing sandals and tripped on a rock. He hit his head and he was gone.\n\n![sarah and cameron](/images/uploads/1_z4ef-5eebgeevxlgmmyavg.jpeg \"sarah and cameron\")\n\nDuring these times of processing death, people often urge you to stop working. I’ve done that. It can help, sometimes. With Cameron, because we were so close, the pain was so deep I felt like it was swallowing me. I couldn’t do anything. Until I could. And the work helped, honestly. I couldn’t process what was going on in any real way when I wasn’t working. I oscillated between fits of despair and numbness. Everything felt blank, like I was out of my body. I couldn’t observe myself. It just pooled around me, and I dissolved.\n\nBut then in work, I found solace. In work, some part of me was occupied. When I was coding, I could detach enough to see myself, to see him, to see our history together, and the loss of what could have been our future friendship. One part of me was focused, and breathing, and occupied. I found that especially when I was doing tasks that I had already mastered, that’s when I could actually process Cameron’s passing.\n\nWhen I sat with the pain, for a little while it was too sharp- there was no room for me there. However, when I was involved in a programming task, my breathing steadied. I could step into it with a bit of cover, and embrace it in a way that didn’t feel so harmful.\n\nThe only caveat to this was QA. Though I usually appreciate QA’s comprehensive study of software and respect that it’s extremely grueling work, while I was mourning, my empathy levels were low. I found it hard to take tickets for edge cases. I felt exhausted if I wasn’t connected to the value of the task.\n\nSocializing when I was mourning was also especially taxing. I found I couldn’t relate to people who weren’t also mourning or hadn’t mourned for a little while. Everything seemed artificial or unimportant. When I was coding, however, I lost my sense of self or even others beyond the normal “what did they mean by this” as I read someone else’s code. I found that I had a bit more patience for refactoring. In a way, it helped- I didn’t have to invent something new, but to improve on what was there, and I could dive really far into that task without my usual hurry and hustle. If nothing was important anymore on the surface, I might as well make it great. Life is short, after all.\n\nI suppose the point of this post is- when you’re in mourning, do what is right for you. I had a lot of people urging me to stop working to process what was happening, in part because I was incredibly productive at this time, and that looks very unnatural from the outside. Hollywood teaches you that mourning is sitting on a bench looking at a tree. I tried that and it wasn’t my path.\n\nLooking back, I think coding really helped me. I don’t believe any two people will share the same process. What works for me might not work for you. But if you’re anything like me, and there’s guilt associated with doing what you need while you’re mourning, I suggest giving yourself a break. Love yourself and honor them in the way that feels healthy for you.",
  "tags": [
    "all posts",
    "introspection"
  ]
}