{
  "title": "Reflections on 2018",
  "date": "December 23rd 2018",
  "thumbnail": "/images/uploads/mawwage2.svg",
  "body": "When I opened the document to write this, I had to pause to remember what year it was. Life has been a blur lately. This is due to jetlag, due to the sheer amount of things going on, and it’s shaped the past year a lot.\n\nPersonally, this year has brought some great life changes. We added Beam to our little family. [If you read last year’s post](https://medium.com/@sarah_edo/feeling-happy-at-the-end-of-the-world-e3a9dab624bb), you’ll know about my dog Sudo. She’s a wise philosopher and mighty hunter. Beam, on the other hand, is a bit of a gremlin dumpling. He steals your stuff, he honks like a goose, he’s always destroying something. But he’s also the most affectionate and sweet little guy. He gets away with everything because of his face.\n\n![beam](/images/uploads/beam.jpg \"beam\")\n\nI also got married to [Dizzy](https://twitter.com/dizzyd). This is great news for me because he’s the best human I’ve ever met and way too good for me (shh, don’t tell him). I’m lucky to be with him. He also has the best kids. Stepmotherhood is a great gig for someone like me who never wanted kids of their own. I zip straight from motherhood to grandmotherhood- we play hide and seek, I spoil them, and we have a really great time together. I never thought I would be content to hang out with kids instead of going to bar with friends on a Friday night- turns out these tiny humans are just as entertaining as drunk people, though there’s still the chance you’ll be barfed on.\n\n![mawwage](/images/uploads/mawwage.jpg \"mawwage\")\n\nIn terms of community work, I kicked it up a notch this year. I made quite a few public GitHub repos, 20 to be specific, gathering **10,028 stars in total**. These stats aren’t really something to over-index on, but what they do allow me to see is whether people are using the projects and appreciate the time investment.\n\nMy favorite among those being:\n\n* [Array Explorer](https://github.com/sdras/array-explorer)\n* [Object Explorer](https://sdras.github.io/object-explorer/)\n* [Project Explorer](https://sdras.github.io/project-explorer-site/) (really gotta think of better names for these)\n* [Page Transitions Travelapp](https://github.com/sdras/page-transitions-travelapp)\n* [Sample Vue Shop](https://github.com/sdras/sample-vue-shop)\n* [Awesome Actions](https://github.com/sdras/awesome-actions)\n\nI made some VS Code extensions:\n\n* [Vue VS Code Snippets](https://marketplace.visualstudio.com/items?itemName=sdras.vue-vscode-snippets&WT.mc_id=marketplace-pack-sdras)\n* [Vue Extension Pack](https://marketplace.visualstudio.com/items?itemName=sdras.vue-vscode-extensionpack&WT.mc_id=twitter-social-sdras)\n* Most notable, [Night Owl Theme](https://aka.ms/nightowl) is used in a lot of places- it was ported 16 times to other platforms, and has **183K downloads** so far.\n\nI wrote **19 posts**, most were on CSS-Tricks, 10 of which were about Vue.js, gathering roughly **half a million views** altogether (483K to be exact). It still astounds me that writing words on these here internets can reach so many people. My favorite of these are:\n\n* [Introducing GitHub Actions](https://css-tricks.com/introducing-github-actions/)\n* [Native-like Page Transitions on the Web](https://css-tricks.com/native-like-animations-for-page-transitions-on-the-web/)\n* [Understanding the Almighty Reducer](<Understanding the Almighty Reducer>)\n\nAs for Vue core, I’ve been working along on the [Cookbook](https://vuejs.org/v2/cookbook/) with great contributions from the community. Honestly I haven’t been able to devote enough time to it lately as I would like, having been on the road and working. I have to turn my attention to it soon to revamp and improve it for [Vue 3 coming out next year](https://medium.com/the-vue-point/plans-for-the-next-iteration-of-vue-js-777ffea6fabf). There’s also some other work I’m gonna get to work on that I hope will be _super dope_, but I can’t tell you about that quite yet 🤫\n\n![vue core in japan](/images/uploads/japan.jpg \"vue core in japan\")\n\n_This photo is of some, not all, of the Vue core team in Japan_\n\nI spoke **30** times in **13** different countries including Iceland, Japan, Poland, the UK, and Switzerland. This is probably the most privileged part of my life, and I appreciate this opportunity so much. It wasn’t even that long ago that I was being rejected from everything, so being invited to these is a real honor.\n\nIt was so fun, but the last few years were also very conference-heavy so I think I really gotta slow it down in the future and find a more sane pace. My goal for this year was to keep it at a dozen and clearly I missed that goal (I love travel). My 12 year old stepdaughter has put herself in charge of my calendar for next year. I have 100% more faith in her than me so that’s the plan. I’d like to make space for others to have that kind of journey if they want it, too.\n\nA record of some of my [slide decks are here](https://noti.st/sdras). My favorite talk of the year was probably this one from JS Conf Iceland:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/i2iCyulbnus\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\nI taught a few workshops, a bunch of Vue ones, some [Web Animation Workshops with Val Head](https://webanimationworkshops.com/), and more recently, [Design for Developers](https://frontendmasters.com/workshops/design-for-devs/) and [SVG Animations](https://frontendmasters.com/courses/svg-animation/) for Frontend Masters. Design for Developers is the first workshop I’ve created solely because people asked me to.\n\nThe most meaningful work of this year was getting to co-organize [Concatenate Conf](https://concatenate.io/) with Christian Nwamba, and Brian Holt, with Prosper Otemuyiwa as our MC. Next year the planning committee has grown to include Gift Egwuenu, who spoke at this year’s event, and Simona Cotin. The concept for this conference is a free conference for Nigerians- due to travel and monetary restrictions, sometimes they are denied access to international developer events, so we wanted to bring the conference there. [Christian wrote an amazing thread about it here](https://twitter.com/codebeast/status/1018828622134743040).\n\n**We filled up 1000 slots in 24 hours!** We had speakers both local and remote and the whole thing was livestreamed. We trended #1 on twitter in Nigeria for almost 4 days. Some businesses in the area declared it a holiday and let people off of work to attend. Collaborating with Christian on this has been a dream- he’s one of the most thoughtful, hardworking, and intelligent people I’ve ever had the opportunity to work with, and if you don’t follow him, you’re missing out.\n\n![](/images/uploads/concatenate.jpg)\n\nWe’re opening sponsorships to this event for October 2019 soon, so if you’re a company and interested in supporting, please reach out! info@concatenate.io. We’re also creating an open collective soon to collect donations from individuals. We’re hoping to fly speakers out next year so we can have an even more hands-on event this time!\n\nI was promoted at Microsoft, I’m now **Lead of Emerging Markets**, Cloud Developer Advocates. Some of what we’re doing in this group is supporting communities like Concatenate Conf did, and that’s so exciting.\n\nAll in all, it’s been pretty busy! I’m actually kind of hoping to slow down a bit next year, I’ve been going pretty hard for a while now and I want to find a better balance. Because I’m an introvert, the OSS work where I sit at home and code all day feels really replenishing while going to speak at conferences takes it out of me completely. I’m definitely planning on maximizing the ways I can contribute from my pajamas. Because that’s the dream, right? That’s my dream, anyways. 🚫👖",
  "tags": [
    "all posts",
    "year end review",
    "life updates"
  ]
}