{
  "title": "Thought Morphology",
  "date": "April 20th 2014",
  "thumbnail": "/images/uploads/thought-morph2.jpg",
  "body": "Phylogenetic is a term used in biology which refers to evolutionary relationships between species. Phylogenetic data is organized in a matrix format. Analysis of a phylo-matrix results in a phylogenetic tree. In my statement, I want to describe the evolution of thoughts and ideas using a phylo-style tree and thus adopted the term phylosynaptic. A synapse is the junction between two nerve cells and is the basis for thought within the brain.\n\n![thought morphology tree](/images/uploads/thoughtmorphology2d.jpg \"thought morphology tree\")\n\nThe first version of this document was created in 2002. At the time, I was working at the Field Museum of Natural History as a Scientific Illustrator. I was surrounded by thousands upon thousands of jars of amphibians, reptiles, and fish, all organized in jars and perched in giant structures based on their placement within the Linnaean System of Classification. I had been studying the Enlightenment and Classical Antiquity philosophies for a few years prior and working there called these studies to the forefront of my mind. These studies played a large part in the development of the concepts that I used to create fine art for the next decade of my life. I was interested in appreciating and critiquing the way that humans, and predominantly, Western civilizations, had used categorical order in thought processes to govern our understanding. I was particularly interested in the flawed logical biases of these categorical systems, and how they all developed.\n\nThe Enlightenment was a time where western civilization began to embrace categorical order. It was the advent of encyclopedias, dictionaries, and the Linnaean System of Classification. The ideas of reductionist thinking, in conjunction with clearly stated principles, tests, and empirical evidence was the basis for a large Scientific Revolution. These ideas were not new — in Ancient Greece, Plato had introduced a Theory of Forms that began to examine the nature of an idea of a characteristic or form can differ from human perception. It was the birth of much philosophical debate that carried on for 2000 years.\n\nThe idea that humankind could understand and control its surroundings through categorical investigation was pertinent to scientific analysis. To me, the implications of this were at once exciting and confounding. Deriving order from chaos is a useful technique for understanding the world, but it can also negatively impact our understanding of the world by creating delineations where there are none. Eleanor Rosch discussed some of these problems in terms of cognitive psychology: she ascertained that for correct scientific analysis, no member of a category could be a “better example” of the category than others, and that the categories being determined had to be separate from the peculiarities of any beings doing the categorizing.\n\nEven with the reductionist processes in place, the management of groupings should also be called into analysis. In George Lakoff’s study of categorical order “Women, Fire, and Dangerous Things” he ascertains from the beginning that categories are problematized through culture as well, such as the instance of the Australian Aboriginal language Dyirbal,\n\n> “which has a category balan, that actually includes women, fire and dangerous things. … This is not simply a matter of categorization by common properties. Categorization is not a matter to be taken lightly.”\n\nIt is particularly easy in a case such as balan to see the implications of a cultural bias, but what of the Western cultural predispositions of which we might not be so aware? The Linnaean System of Classification had to have been biased in some ways. Today, biologists compare morphological data based on DNA analysis. Prior to the era where this was possible, scientists would use what is called a morphological tree. The basic premise was to create a list of all of the features that a species could possess and then figure out how many characteristics were aligned. From this analysis, a morphological tree could be determined with those species that had the most commonalities situated together and grouped out into the Linnaean System.\n\nBut who determines what are called traits? Certainly the data could be slanted by an unequal measure of features in any given area. This is merely an example, of course, the critique works for so many types of categorical systems.\n\nDespite these flaws, I am in awe of such a system. The ability to determine similarities of very abstract concepts or evolutionary processes, even species, is impressive to say the least. It is exciting and useful that this kind of analysis is possible and that we can create ordered observations and critical conclusions from that which surrounds us.\n\nMy critique and appreciation for the system comes in the form of my artist’s statement, where I decided to create an analysis of the thoughts that I have when I create a piece of art. I was interested to see what commonalities emerged, wondering if I could perhaps learn something but also critiquing the system a bit (with a touch of humor). Most of my art touches on categorical order, and thus the statement of artist intent should be composed of those concepts, too.",
  "tags": [
    "all posts",
    "introspection"
  ]
}