{
  "title": "Why Netlify?",
  "date": "April 27th 2019",
  "thumbnail": "/images/uploads/celebrate4.webp",
  "body": "I’ve taken a new position at [Netlify](https://www.netlify.com/) as **Head of Developer Experience**! I’m so excited for this change and it makes sense to provide a little context for those who are curious about general career decisions and arc. \n\nWork is where you spend the majority of your waking hours, so career decisions, though only being one aspect of your life, take up so much of our time. I wanted to work on a product that I think paves the road for the web ahead, smoothes pain points and frees people to focus on the tasks that are meaningful to them. For me, that’s Netlify. I’ve been using them for quite a while as a maintainer of the [Vue documentation](https://vuejs.org/) which uses Netlify for deploy and was so impressed with the experience. I came to think of it as a gold standard of developer experience for static sites, forms, and more.\n\n### Smaller for Big Changes\n\nThe company is large enough to create great impact yet small enough to adjust and adapt to the ever changing landscape with care and ease. After working at a few bigger companies as both full-time and consultant, I wanted to work at a smaller place where there was less bureaucracy and we could move quickly and do more with less. **_I’m at the point in my career where I really want to stir shit up._** Not only do I think this is possible at Netlify, but the company itself is making huge strides in this landscape and I’m excited to be a part of it.\n\n### The Company You Keep\n\nI paid close attention to who I would be working with, as that can also shape a job. The prospect of working with [Frances Berriman](https://twitter.com/phae) ([co-creator of PWAs](https://en.wikipedia.org/wiki/Progressive_web_applications#Characteristics)), [Phil Hawksworth](https://twitter.com/philhawksworth), [Divya Sasidharan](https://twitter.com/shortdiv), [Shawn Wang](https://twitter.com/swyx), and [David Calavera](https://twitter.com/calavera), among many other really impressive people, is exciting!\n\nAs we talked about what kind of job I would have at this company, I was surprised and delighted by how much [Matt Biilmann](https://twitter.com/biilmann) and [Chris Bach](https://twitter.com/Chr_Bach), the founders, genuinely listened and helped shape my position in a way that played to my strengths and career goals, while finding the focus that would make the most sense for the company. This way of refining, strategizing, and collaborating feels like they’ve already done so much due diligence towards setting me up for success and valuing me. I feel so much gratitude for their trust and investment.\n\nThis very post is now written on my new blog- I took my posts off Medium, moved my site over to Netlify, and created this new section. I primarily write for [CSS-Tricks](https://css-tricks.com/) but this is the home for more personal content. \n\nI'll be putting out a few posts on how I made this with Nuxt and Netlify CMS, along with a repo if you want to get started trying it out yourself.\n\nI couldn’t be more thrilled!  **I start on May 13**, and you can look forward to a lot of advancements from me and my team in the coming months on making things even more easy to work with and understand!",
  "tags": [
    "all posts",
    "life updates"
  ]
}